andrewleech/micropython/ports/mimxrt/sdcard.c
#if defined MICROPY_USDHC1 && USDHC1_AVAIL
const mimxrt_sdcard_obj_pins_t mimxrt_sdcard_1_obj_pins = MICROPY_USDHC1;
#endif

#if defined MICROPY_USDHC2 && USDHC2_AVAIL
const mimxrt_sdcard_obj_pins_t mimxrt_sdcard_2_obj_pins = MICROPY_USDHC2;
#endif

#if defined MICROPY_USDHC1 && USDHC1_AVAIL
mimxrt_sdcard_status_obj_t sdcard_usdhc1_state = {.initialized = false, .inserted = false};
#endif
#if defined MICROPY_USDHC2 && USDHC2_AVAIL
mimxrt_sdcard_status_obj_t sdcard_usdhc2_state = {.initialized = false, .inserted = false};
#endif

mimxrt_sdcard_obj_t mimxrt_sdcard_objs[] =
{
    #if defined MICROPY_USDHC1 && USDHC1_AVAIL
    {
        .base.type = &machine_sdcard_type,
        .usdhc_inst = USDHC1,
        .state = &sdcard_usdhc1_state,
        .rca = 0x0UL,
        .block_len = SDCARD_DEFAULT_BLOCK_SIZE,
        .block_count = 0UL,
        .pins = &mimxrt_sdcard_1_obj_pins,
    },
    #endif
    #if defined MICROPY_USDHC2 && USDHC2_AVAIL
    {
        .base.type = &machine_sdcard_type,
        .usdhc_inst = USDHC2,
        .state = &sdcard_usdhc2_state,
        .rca = 0x0UL,
        .block_len = SDCARD_DEFAULT_BLOCK_SIZE,
        .block_count = 0UL,
        .pins = &mimxrt_sdcard_2_obj_pins,
    };
    #endif
};

// ---
// Local function declarations
// ---
static status_t sdcard_transfer_blocking(USDHC_Type *base, usdhc_transfer_t *transfer, uint32_t timeout_ms);
static void sdcard_decode_csd(mimxrt_sdcard_obj_t *sdcard, csd_t *csd);
static bool sdcard_reset(mimxrt_sdcard_obj_t *card);
static inline void sdcard_init_pin(const machine_pin_obj_t *pin, uint8_t af_idx, uint32_t config_value);

// SD Card interrupt callbacks
void sdcard_card_inserted_callback(USDHC_Type *base, void *userData);
void sdcard_card_removed_callback(USDHC_Type *base, void *userData);
void sdcard_dummy_callback(USDHC_Type *base, void *userData);

// SD Card commands
static bool sdcard_cmd_go_idle_state(mimxrt_sdcard_obj_t *card);
static bool sdcard_cmd_oper_cond(mimxrt_sdcard_obj_t *card);
static bool sdcard_cmd_app_cmd(mimxrt_sdcard_obj_t *card);
static bool sdcard_cmd_sd_app_op_cond(mimxrt_sdcard_obj_t *card, uint32_t argument);
static bool sdcard_cmd_all_send_cid(mimxrt_sdcard_obj_t *card, cid_t *cid);
static bool sdcard_cmd_send_cid(mimxrt_sdcard_obj_t *card, cid_t *cid);
static bool sdcard_cmd_set_rel_add(mimxrt_sdcard_obj_t *card);
static bool sdcard_cmd_send_csd(mimxrt_sdcard_obj_t *card, csd_t *csd);
static bool sdcard_cmd_select_card(mimxrt_sdcard_obj_t *sdcard);
static bool sdcard_cmd_set_blocklen(mimxrt_sdcard_obj_t *sdcard);
static bool sdcard_cmd_set_bus_width(mimxrt_sdcard_obj_t *sdcard, usdhc_data_bus_width_t bus_width);
static bool sdcard_cmd_send_status(mimxrt_sdcard_obj_t *card);
static bool sdcard_wait_ready(mimxrt_sdcard_obj_t *card, uint32_t timeout_ms);

void sdcard_card_inserted_callback(USDHC_Type *base, void *userData) {
    #if defined MICROPY_USDHC1 && USDHC1_AVAIL
    if (base == USDHC1) {
        sdcard_usdhc1_state.inserted = true;
    }
    #endif
    #if defined MICROPY_USDHC2 && USDHC2_AVAIL
    if (base == USDHC2) {
        sdcard_usdhc2_state.inserted = true;

    }
    #endif

    USDHC_ClearInterruptStatusFlags(base, kUSDHC_CardInsertionFlag);
}

void sdcard_card_removed_callback(USDHC_Type *base, void *userData) {
    #if defined MICROPY_USDHC1 && USDHC1_AVAIL
    if (base == USDHC1) {
        sdcard_usdhc1_state.inserted = false;
        sdcard_usdhc1_state.initialized = false;
    }
    #endif
    #if defined MICROPY_USDHC2 && USDHC2_AVAIL
    if (base == USDHC2) {
        sdcard_usdhc2_state.inserted = false;
        sdcard_usdhc2_state.initialized = false;
    }
    #endif

    USDHC_ClearInterruptStatusFlags(base, kUSDHC_CardRemovalFlag);
}

void sdcard_dummy_callback(USDHC_Type *base, void *userData) {
    return;
}

#if MICROPY_HW_SDCARD_NONBLOCKING

// Transfer complete callback (Zephyr-style)
static void sdcard_transfer_complete_callback(USDHC_Type *base,
    usdhc_handle_t *handle, status_t status, void *userData) {
    mimxrt_sdcard_obj_t *card = (mimxrt_sdcard_obj_t *)userData;

    // Guard against callback firing with invalid userData
    if (card == NULL || card->state == NULL) {
        return;
    }

    if (status == kStatus_USDHC_TransferDataFailed) {
        card->state->transfer_status |= TRANSFER_DATA_FAILED;
    } else if (status == kStatus_USDHC_TransferDataComplete ||
               status == kStatus_USDHC_TransferDMAComplete) {
        // Memory barrier BEFORE setting the flag, so any code waiting on this
        // flag will see the DMA data correctly.
        __DSB();
        __ISB();
        card->state->transfer_status |= TRANSFER_DATA_COMPLETE;
    } else if (status == kStatus_USDHC_SendCommandFailed) {
        card->state->transfer_status |= TRANSFER_CMD_FAILED;
    } else if (status == kStatus_USDHC_SendCommandSuccess) {
        card->state->transfer_status |= TRANSFER_CMD_COMPLETE;
    }
    // Note: kStatus_USDHC_BusyTransferring is ignored (intermediate state)
}
#endif // MICROPY_HW_SDCARD_NONBLOCKING

static void sdcard_error_recovery(USDHC_Type *base) {
    uint32_t status = 0U;
    /* get host present status */
    status = USDHC_GetPresentStatusFlags(base);
    /* check command inhibit status flag */
    if ((status & (uint32_t)kUSDHC_CommandInhibitFlag) != 0U) {
        /* reset command line */
        (void)USDHC_Reset(base, kUSDHC_ResetCommand, 100U);
    }
    /* check data inhibit status flag */
    if (((status & (uint32_t)kUSDHC_DataInhibitFlag) != 0U) || (USDHC_GetAdmaErrorStatusFlags(base) != 0U)) {
        /* reset data line */
        (void)USDHC_Reset(base, kUSDHC_ResetData, 100U);
    }
}

#if MICROPY_HW_SDCARD_NONBLOCKING

// Non-blocking transfer with Zephyr-style callback wait.
// Uses mp_hal_delay_ms to allow background tasks to run.
static status_t sdcard_transfer_nonblocking(USDHC_Type *base, usdhc_handle_t *handle,
    usdhc_transfer_t *transfer, uint32_t cmd_timeout_ms, uint32_t data_timeout_ms) {
    mimxrt_sdcard_obj_t *card = (mimxrt_sdcard_obj_t *)handle->userData;
    status_t error;

    // Reset transfer status
    card->state->transfer_status = 0;

    // Note: Cache maintenance is handled by sdcard_read/sdcard_write callers
    usdhc_data_t *data = transfer->data;

    // Configure DMA if enabled
    #if MICROPY_HW_SDCARD_USE_DMA
    usdhc_adma_config_t dma_config = {
        .dmaMode = kUSDHC_DmaModeAdma2,
        #if !(defined(FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN) && FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN)
        .burstLen = kUSDHC_EnBurstLenForINCR,
        #endif
        .admaTable = sdcard_adma_descriptor_table,
        .admaTableWords = DMA_DESCRIPTOR_BUFFER_SIZE,
    };
    error = USDHC_TransferNonBlocking(base, handle, &dma_config, transfer);
    #else
    error = USDHC_TransferNonBlocking(base, handle, NULL, transfer);
    #endif

    if (error == kStatus_USDHC_ReTuningRequest) {
        return kStatus_USDHC_ReTuningRequest;
    } else if (error != kStatus_Success) {
        return error;
    }

