andrewleech/micropython/ports/mimxrt/sdcard.c
    // Wait for command completion
    uint32_t start = mp_hal_ticks_ms();
    uint32_t xfer_status;
    while (((xfer_status = card->state->transfer_status) & TRANSFER_CMD_FLAGS) == 0) {
        if ((mp_hal_ticks_ms() - start) >= cmd_timeout_ms) {
            sdcard_error_recovery(base);
            return kStatus_Timeout;
        }
        // Tight poll - command completion is fast
    }

    if (xfer_status & TRANSFER_CMD_FAILED) {
        sdcard_error_recovery(base);
        return kStatus_USDHC_SendCommandFailed;
    }

    // Wait for data completion if present
    if (data != NULL) {
        start = mp_hal_ticks_ms();
        while (((xfer_status = card->state->transfer_status) & TRANSFER_DATA_FLAGS) == 0) {
            if ((mp_hal_ticks_ms() - start) >= data_timeout_ms) {
                sdcard_error_recovery(base);
                return kStatus_Timeout;
            }
            // Tight poll - we need precise timing for cache coherency
        }

        if (xfer_status & TRANSFER_DATA_FAILED) {
            sdcard_error_recovery(base);
            return kStatus_USDHC_TransferDataFailed;
        }

        // The callback already executed DSB/ISB before setting the complete flag,
        // so DMA writes should be fully visible. But we still need to invalidate
        // cache in case of speculative fills between IRQ handler and here.
        if (data->rxData != NULL) {
            // Additional barrier after exiting interrupt context
            __DSB();
            __ISB();
            size_t data_size = data->blockSize * data->blockCount;
            MP_HAL_CLEANINVALIDATE_DCACHE(data->rxData, data_size);
        }
    }

    return kStatus_Success;
}

// Wrapper that calls non-blocking implementation
static status_t sdcard_transfer_blocking(USDHC_Type *base, usdhc_transfer_t *transfer, uint32_t timeout_ms) {
    // Find card object from base address
    mimxrt_sdcard_obj_t *card = NULL;
    for (size_t i = 0; i < MP_ARRAY_SIZE(mimxrt_sdcard_objs); i++) {
        if (mimxrt_sdcard_objs[i].usdhc_inst == base) {
            card = &mimxrt_sdcard_objs[i];
            break;
        }
    }
    if (card == NULL) {
        return kStatus_Fail;
    }
    return sdcard_transfer_nonblocking(base, &card->handle, transfer, timeout_ms, timeout_ms);
}

#elif MICROPY_HW_SDCARD_POLLING
// ============================================================================
// Polling-based transfer mode: DMA with scheduler-friendly flag polling
// This mode manually configures DMA and polls status flags (no interrupts).
// Uses mp_event_handle_nowait() in polling loops to allow scheduler yields.
// ============================================================================

// Read command response from USDHC registers (mirrors SDK's internal function)
static status_t sdcard_polling_receive_response(USDHC_Type *base, usdhc_command_t *command) {
    uint32_t response0 = base->CMD_RSP0;
    uint32_t response1 = base->CMD_RSP1;
    uint32_t response2 = base->CMD_RSP2;

    if (command->responseType != kCARD_ResponseTypeNone) {
        command->response[0U] = response0;
        if (command->responseType == kCARD_ResponseTypeR2) {
            // R3-R2-R1-R0 format (CID/CSD response)
            command->response[0U] <<= 8U;
            command->response[1U] = (response1 << 8U) | ((response0 & 0xFF000000U) >> 24U);
            command->response[2U] = (response2 << 8U) | ((response1 & 0xFF000000U) >> 24U);
            command->response[3U] = (base->CMD_RSP3 << 8U) | ((response2 & 0xFF000000U) >> 24U);
        }
    }

    // Check response error flags
    if ((command->responseErrorFlags != 0U) &&
        ((command->responseType == kCARD_ResponseTypeR1) || (command->responseType == kCARD_ResponseTypeR1b) ||
         (command->responseType == kCARD_ResponseTypeR6) || (command->responseType == kCARD_ResponseTypeR5))) {
        if (((command->responseErrorFlags) & (command->response[0U])) != 0U) {
            return kStatus_USDHC_SendCommandFailed;
        }
    }

    return kStatus_Success;
}

// Polling-based transfer with scheduler yields
static status_t sdcard_transfer_blocking(USDHC_Type *base, usdhc_transfer_t *transfer, uint32_t timeout_ms) {
    usdhc_command_t *command = transfer->command;
    usdhc_data_t *data = transfer->data;
    status_t error = kStatus_Success;
    uint32_t interruptStatus = 0U;
    uint32_t start_ms;

    usdhc_adma_config_t dma_config = {
        .dmaMode = kUSDHC_DmaModeAdma2,
        #if !(defined(FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN) && FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN)
        .burstLen = kUSDHC_EnBurstLenForINCR,
        #endif
        .admaTable = sdcard_adma_descriptor_table,
        .admaTableWords = DMA_DESCRIPTOR_BUFFER_SIZE,
    };

    // Check for re-tuning request
    #if defined(FSL_FEATURE_USDHC_HAS_SDR50_MODE) && (FSL_FEATURE_USDHC_HAS_SDR50_MODE)
    if ((USDHC_GetInterruptStatusFlags(base) & (uint32_t)kUSDHC_ReTuningEventFlag) != 0UL) {
        USDHC_ClearInterruptStatusFlags(base, kUSDHC_ReTuningEventFlag);
        return kStatus_USDHC_ReTuningRequest;
    }
    #endif

    // Configure DMA for data transfers
    if (data != NULL) {
        // Check data inhibit flag before configuring data transfer
        if ((USDHC_GetPresentStatusFlags(base) & (uint32_t)kUSDHC_DataInhibitFlag) != 0U) {
            return kStatus_USDHC_BusyTransferring;
        }

        error = USDHC_SetAdmaTableConfig(base, &dma_config, data, kUSDHC_AdmaDescriptorSingleFlag);
        if (error != kStatus_Success) {
            return kStatus_USDHC_PrepareAdmaDescriptorFailed;
        }

        // Configure data transfer parameters
        // Note: USDHC_SetDataConfig doesn't set all required flags, so we configure MIX_CTRL directly
        usdhc_transfer_direction_t direction = (data->txData != NULL) ?
            kUSDHC_TransferDirectionSend : kUSDHC_TransferDirectionReceive;

        // Set block attributes
        base->BLK_ATT = ((base->BLK_ATT & ~(USDHC_BLK_ATT_BLKSIZE_MASK | USDHC_BLK_ATT_BLKCNT_MASK)) |
            (USDHC_BLK_ATT_BLKSIZE(data->blockSize) | USDHC_BLK_ATT_BLKCNT(data->blockCount)));

        // Configure MIX_CTRL for data transfer
        uint32_t mixCtrl = base->MIX_CTRL;
        mixCtrl &= ~(USDHC_MIX_CTRL_MSBSEL_MASK | USDHC_MIX_CTRL_BCEN_MASK | USDHC_MIX_CTRL_DTDSEL_MASK |
            USDHC_MIX_CTRL_AC12EN_MASK | USDHC_MIX_CTRL_AC23EN_MASK);

        // Set direction
        mixCtrl |= USDHC_MIX_CTRL_DTDSEL(direction);

        // Multi-block transfers need MSBSEL and BCEN
        if (data->blockCount > 1U) {
            mixCtrl |= USDHC_MIX_CTRL_MSBSEL_MASK | USDHC_MIX_CTRL_BCEN_MASK;
            if (data->enableAutoCommand12) {
                mixCtrl |= USDHC_MIX_CTRL_AC12EN_MASK;
            }
        }

        // Auto CMD23 setup
        if (data->enableAutoCommand23) {
            mixCtrl |= USDHC_MIX_CTRL_AC23EN_MASK;
            base->VEND_SPEC2 |= USDHC_VEND_SPEC2_ACMD23_ARGU2_EN_MASK;
            base->DS_ADDR = data->blockCount;
        } else {
            base->VEND_SPEC2 &= ~USDHC_VEND_SPEC2_ACMD23_ARGU2_EN_MASK;
        }

        base->MIX_CTRL = mixCtrl;

        // Enable DMA
        USDHC_EnableInternalDMA(base, true);

        // Set data present flag for command
        command->flags |= (uint32_t)kUSDHC_DataPresentFlag;
    } else {
        // Command-only: check command inhibit flag
        if ((USDHC_GetPresentStatusFlags(base) & (uint32_t)kUSDHC_CommandInhibitFlag) != 0U) {
            return kStatus_USDHC_BusyTransferring;
        }

