andrewleech/micropython/ports/mimxrt/sdcard.c
        // Clear data flags for command-only transfers
        uint32_t mixCtrl = base->MIX_CTRL;
        mixCtrl &= ~(USDHC_MIX_CTRL_MSBSEL_MASK | USDHC_MIX_CTRL_BCEN_MASK | USDHC_MIX_CTRL_DTDSEL_MASK |
            USDHC_MIX_CTRL_AC12EN_MASK | USDHC_MIX_CTRL_AC23EN_MASK);
        base->MIX_CTRL = mixCtrl;
    }

    // Clear any pending status flags before starting
    USDHC_ClearInterruptStatusFlags(base, kUSDHC_CommandFlag | kUSDHC_DataDMAFlag);

    // Send command
    USDHC_SendCommand(base, command);

    // Poll for command completion with scheduler yields
    start_ms = mp_hal_ticks_ms();
    while (!(interruptStatus & kUSDHC_CommandFlag)) {
        interruptStatus = USDHC_GetInterruptStatusFlags(base);
        if ((mp_hal_ticks_ms() - start_ms) >= timeout_ms) {
            sdcard_error_recovery(base);
            return kStatus_Timeout;
        }
        mp_event_handle_nowait();  // Allow scheduler to run
    }

    // Check for command errors
    if ((interruptStatus & (uint32_t)kUSDHC_CommandErrorFlag) != 0UL) {
        USDHC_ClearInterruptStatusFlags(base, kUSDHC_CommandFlag);
        sdcard_error_recovery(base);
        return kStatus_USDHC_SendCommandFailed;
    }

    // Read command response
    error = sdcard_polling_receive_response(base, command);
    USDHC_ClearInterruptStatusFlags(base, kUSDHC_CommandFlag);

    if (error != kStatus_Success) {
        sdcard_error_recovery(base);
        return kStatus_USDHC_SendCommandFailed;
    }

    // Poll for data DMA completion with scheduler yields
    if (data != NULL) {
        interruptStatus = 0U;
        start_ms = mp_hal_ticks_ms();
        while (!(interruptStatus & (kUSDHC_DataDMAFlag | kUSDHC_TuningErrorFlag))) {
            interruptStatus = USDHC_GetInterruptStatusFlags(base);
            if ((mp_hal_ticks_ms() - start_ms) >= timeout_ms) {
                sdcard_error_recovery(base);
                return kStatus_Timeout;
            }
            mp_event_handle_nowait();  // Allow scheduler to run
        }

        #if defined(FSL_FEATURE_USDHC_HAS_SDR50_MODE) && (FSL_FEATURE_USDHC_HAS_SDR50_MODE)
        if (interruptStatus & kUSDHC_TuningErrorFlag) {
            USDHC_ClearInterruptStatusFlags(base, kUSDHC_TuningErrorFlag);
            sdcard_error_recovery(base);
            return kStatus_USDHC_TuningError;
        }
        #endif

        if (interruptStatus & ((uint32_t)kUSDHC_DataErrorFlag | (uint32_t)kUSDHC_DmaErrorFlag)) {
            USDHC_ClearInterruptStatusFlags(base, kUSDHC_DataDMAFlag | kUSDHC_TuningErrorFlag);
            sdcard_error_recovery(base);
            return kStatus_USDHC_TransferDataFailed;
        }

        USDHC_ClearInterruptStatusFlags(base, kUSDHC_DataDMAFlag | kUSDHC_TuningErrorFlag);
    }

    return kStatus_Success;
}

#else // !MICROPY_HW_SDCARD_NONBLOCKING && !MICROPY_HW_SDCARD_POLLING

// Timing statistics (in microseconds) - enable with SDCARD_TIMING_DEBUG
#define SDCARD_TIMING_DEBUG (1)

#if SDCARD_TIMING_DEBUG
static volatile uint32_t sdcard_wait_time_us = 0;
static volatile uint32_t sdcard_xfer_time_us = 0;
static volatile uint32_t sdcard_xfer_count = 0;
#endif

// Wait for card to be ready by polling Data0 line.
// Data0 low indicates card is busy. Yields to scheduler while waiting.
static bool sdcard_wait_data0_ready(USDHC_Type *base, uint32_t timeout_ms) {
    uint32_t start = mp_hal_ticks_ms();
    while ((mp_hal_ticks_ms() - start) < timeout_ms) {
        if ((USDHC_GetPresentStatusFlags(base) & (uint32_t)kUSDHC_Data0LineLevelFlag) != 0) {
            return true;
        }
        mp_event_handle_nowait();
    }
    return false;
}

// Scheduler-friendly blocking transfer.
// Uses SDK's USDHC_TransferBlocking which handles all the complex register setup,
// but waits for card ready state with scheduler yields beforehand.
// The actual DMA transfer is fast once started, so tight polling there is acceptable.
static status_t sdcard_transfer_blocking(USDHC_Type *base, usdhc_transfer_t *transfer, uint32_t timeout_ms) {
    usdhc_data_t *data = transfer->data;

    usdhc_adma_config_t dma_config = {
        .dmaMode = kUSDHC_DmaModeAdma2,
        #if !(defined(FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN) && FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN)
        .burstLen = kUSDHC_EnBurstLenForINCR,
        #endif
        .admaTable = sdcard_adma_descriptor_table,
        .admaTableWords = DMA_DESCRIPTOR_BUFFER_SIZE,
    };

    // For data transfers, wait for card to be ready (yields to scheduler)
    bool has_data = (data != NULL) && ((data->txData != NULL) || (data->rxData != NULL));

    #if SDCARD_TIMING_DEBUG
    uint32_t t0 = ticks_us32();
    #endif

    if (has_data && !sdcard_wait_data0_ready(base, timeout_ms)) {
        return kStatus_Timeout;
    }

    #if SDCARD_TIMING_DEBUG
    uint32_t t1 = ticks_us32();
    #endif

    // Use SDK blocking transfer - handles complex register setup correctly
    status_t error = USDHC_TransferBlocking(base, &dma_config, transfer);

    #if SDCARD_TIMING_DEBUG
    uint32_t t2 = ticks_us32();
    if (has_data) {
        sdcard_wait_time_us += (t1 - t0);
        sdcard_xfer_time_us += (t2 - t1);
        sdcard_xfer_count++;
    }
    #endif

    if (error != kStatus_Success) {
        sdcard_error_recovery(base);
    }
    return error;
}

#if SDCARD_TIMING_DEBUG
// Get and reset timing statistics: (wait_us, xfer_us, count)
static mp_obj_t sdcard_get_timing_stats(mp_obj_t self_in) {
    (void)self_in;  // Unused - timing is global
    uint32_t wait = sdcard_wait_time_us;
    uint32_t xfer = sdcard_xfer_time_us;
    uint32_t count = sdcard_xfer_count;
    sdcard_wait_time_us = 0;
    sdcard_xfer_time_us = 0;
    sdcard_xfer_count = 0;

    mp_obj_t tuple[3] = {
        mp_obj_new_int(wait),
        mp_obj_new_int(xfer),
        mp_obj_new_int(count),
    };
    return mp_obj_new_tuple(3, tuple);
}
MP_DEFINE_CONST_FUN_OBJ_1(sdcard_get_timing_stats_obj, sdcard_get_timing_stats);
#endif

#endif // MICROPY_HW_SDCARD_NONBLOCKING

static void sdcard_decode_csd(mimxrt_sdcard_obj_t *card, csd_t *csd) {
    uint8_t csd_structure = 0x3 & (csd->data[3] >> 30);
    uint8_t read_bl_len;
    uint32_t c_size;
    uint8_t c_size_mult;

